# Pandas-DataFrame And Series:
## Pandas is a powerful data manipulation library in Python, widely used for data analysis and data cleaning. It provides two primary data structures: Series and DataFrame. A Series is a one-dimensional array-like object, while a DataFrame is a two-dimensional, size-mutable, and potentially heterogeneous tabular data structure with labeled axes (rows and columns). ðŸ¼
## ***i.e., Pandas lets you work with Excel-like data tables in Python for cleaning, filtering, and analysis.***

In [3]:
!pip install pandas

Requirement already satisfied: pandas in c:\users\surya\onedrive\ds, ml, dl\mykernel\lib\site-packages (2.3.3)
Requirement already satisfied: numpy>=1.26.0 in c:\users\surya\onedrive\ds, ml, dl\mykernel\lib\site-packages (from pandas) (2.4.0)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\surya\onedrive\ds, ml, dl\mykernel\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\surya\onedrive\ds, ml, dl\mykernel\lib\site-packages (from pandas) (2025.2)
Requirement already satisfied: tzdata>=2022.7 in c:\users\surya\onedrive\ds, ml, dl\mykernel\lib\site-packages (from pandas) (2025.3)
Requirement already satisfied: six>=1.5 in c:\users\surya\onedrive\ds, ml, dl\mykernel\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)

In [2]:
import pandas as pd
data = [1,2,3,4,5]
series = pd.Series(data)
print(f'Series :\n {series}')
print(type(series))

Series :
 0    1
1    2
2    3
3    4
4    5
dtype: int64
<class 'pandas.core.series.Series'>

In [3]:
## Creating a Series from a dictionary
data = {'a':1, 'b':2, 'c':3}
series_dict = pd.Series(data)
print(series_dict)

a    1
b    2
c    3
dtype: int64

In [4]:
data = [10,20,30]
index = ['a', 'b', 'c']
pd.Series(data, index=index)

a    10
b    20
c    30
dtype: int64

In [10]:
## DataFrame
## create a DataFrame from a dictionary of list

data = {
    'Name':['Surya', 'Krish', 'John'],
    'Age':[25, 30, 45],
    'City':["Bangalore", "New York", 'Florida']
}
df = pd.DataFrame(data)
print(df)
print(type(df))

    Name  Age       City
0  Surya   25  Bangalore
1  Krish   30   New York
2   John   45    Florida
<class 'pandas.core.frame.DataFrame'>

In [46]:
## create a DataFrame from a list of dictionaries

data = [
    {'Name': 'Surya', "Age":25, 'City':'Bangalore'},
    {'Name': 'Krish', "Age":30, 'City':'New York'},
    {'Name': 'John', "Age":45, 'City':'Florida'}
]
df = pd.DataFrame(data)
print(df)
print(type(df))

    Name  Age       City
0  Surya   25  Bangalore
1  Krish   30   New York
2   John   45    Florida
<class 'pandas.core.frame.DataFrame'>

In [15]:
df = pd.read_csv('sales_data.csv')
df.head(5)

,Transaction ID,Date,Product Category,Product Name,Units Sold,Unit Price,Total Revenue,Region,Payment Method
0,10001,2024-01-01,Electronics,iPhone 14 Pro,2,999.99,1999.98,North America,Credit Card
1,10002,2024-01-02,Home Appliances,Dyson V11 Vacuum,1,499.99,499.99,Europe,PayPal
2,10003,2024-01-03,Clothing,Levi's 501 Jeans,3,69.99,209.97,Asia,Debit Card
3,10004,2024-01-04,Books,The Da Vinci Code,4,15.99,63.96,North America,Credit Card
4,10005,2024-01-05,Beauty Products,Neutrogena Skincare Set,1,89.99,89.99,Europe,PayPal

In [16]:
df.tail(5)

,Transaction ID,Date,Product Category,Product Name,Units Sold,Unit Price,Total Revenue,Region,Payment Method
235,10236,2024-08-23,Home Appliances,Nespresso Vertuo Next Coffee and Espresso Maker,1,159.99,159.99,Europe,PayPal
236,10237,2024-08-24,Clothing,Nike Air Force 1 Sneakers,3,90.00,270.00,Asia,Debit Card
237,10238,2024-08-25,Books,The Handmaid's Tale by Margaret Atwood,3,10.99,32.97,North America,Credit Card
238,10239,2024-08-26,Beauty Products,Sunday Riley Luna Sleeping Night Oil,1,55.00,55.00,Europe,PayPal
239,10240,2024-08-27,Sports,Yeti Rambler 20 oz Tumbler,2,29.99,59.98,Asia,Credit Card

In [47]:
df

    Name  Age       City
0  Surya   25  Bangalore
1  Krish   30   New York
2   John   45    Florida

In [48]:
## Accessing Data from Dataframe
type(df['Name'])

pandas.core.series.Series

In [49]:
df.loc[0] #row index

Name        Surya
Age            25
City    Bangalore
Name: 0, dtype: object

In [50]:
df.iloc[0][2]

C:\Users\Surya\AppData\Local\Temp\ipykernel_16508\2519637664.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  df.iloc[0][2]

'Bangalore'

In [51]:
## Accessing a specified element
print(df.at[2,'Name'])
print(df.at[1, 'Age'])

John
30

In [52]:
df.iat[2,2]

'Florida'

In [53]:
df

    Name  Age       City
0  Surya   25  Bangalore
1  Krish   30   New York
2   John   45    Florida

In [54]:
## Data Manipulation with Dataframes
df['Salary'] = [50000, 60000, 70000]
df

    Name  Age       City  Salary
0  Surya   25  Bangalore   50000
1  Krish   30   New York   60000
2   John   45    Florida   70000

In [55]:
## Remove a col
df.drop('Salary', axis=1, inplace=True)

In [56]:
df

    Name  Age       City
0  Surya   25  Bangalore
1  Krish   30   New York
2   John   45    Florida

In [57]:
## Add age to the column
df['Age'] = df['Age']+1
df

    Name  Age       City
0  Surya   26  Bangalore
1  Krish   31   New York
2   John   46    Florida

In [58]:
df.drop(0, inplace=True)

In [59]:
df

    Name  Age      City
1  Krish   31  New York
2   John   46   Florida

In [60]:
df = pd.read_csv('sales_data.csv')
df.head(5)

,Transaction ID,Date,Product Category,Product Name,Units Sold,Unit Price,Total Revenue,Region,Payment Method
0,10001,2024-01-01,Electronics,iPhone 14 Pro,2,999.99,1999.98,North America,Credit Card
1,10002,2024-01-02,Home Appliances,Dyson V11 Vacuum,1,499.99,499.99,Europe,PayPal
2,10003,2024-01-03,Clothing,Levi's 501 Jeans,3,69.99,209.97,Asia,Debit Card
3,10004,2024-01-04,Books,The Da Vinci Code,4,15.99,63.96,North America,Credit Card
4,10005,2024-01-05,Beauty Products,Neutrogena Skincare Set,1,89.99,89.99,Europe,PayPal

In [62]:
# Display the data types of each column
print('Data types :\n', df.dtypes)

# Decribe the DataFrame 
print('Statistical Summary: \n', df.describe())

Data types :
 Transaction ID        int64
Date                 object
Product Category     object
Product Name         object
Units Sold            int64
Unit Price          float64
Total Revenue       float64
Region               object
Payment Method       object
dtype: object
Statistical Summary:
        Transaction ID  Units Sold   Unit Price  Total Revenue
count       240.00000  240.000000   240.000000     240.000000
mean      10120.50000    2.158333   236.395583     335.699375
std          69.42622    1.322454   429.446695     485.804469
min       10001.00000    1.000000     6.500000       6.500000
25%       10060.75000    1.000000    29.500000      62.965000
50%       10120.50000    2.000000    89.990000     179.970000
75%       10180.25000    3.000000   249.990000     399.225000
max       10240.00000   10.000000  3899.990000    3899.990000

In [63]:
df.describe()

       Transaction ID  Units Sold   Unit Price  Total Revenue
count       240.00000  240.000000   240.000000     240.000000
mean      10120.50000    2.158333   236.395583     335.699375
std          69.42622    1.322454   429.446695     485.804469
min       10001.00000    1.000000     6.500000       6.500000
25%       10060.75000    1.000000    29.500000      62.965000
50%       10120.50000    2.000000    89.990000     179.970000
75%       10180.25000    3.000000   249.990000     399.225000
max       10240.00000   10.000000  3899.990000    3899.990000

In [2]:
import pandas as pd

df = pd.read_csv("Deaths_by_Police_US.csv", encoding="latin1")
df

,id,name,date,manner_of_death,armed,age,gender,race,city,state,signs_of_mental_illness,threat_level,flee,body_camera
0,3,Tim Elliot,02/01/15,shot,gun,53.0,M,A,Shelton,WA,True,attack,Not fleeing,False
1,4,Lewis Lee Lembke,02/01/15,shot,gun,47.0,M,W,Aloha,OR,False,attack,Not fleeing,False
2,5,John Paul Quintero,03/01/15,shot and Tasered,unarmed,23.0,M,H,Wichita,KS,False,other,Not fleeing,False
3,8,Matthew Hoffman,04/01/15,shot,toy weapon,32.0,M,W,San Francisco,CA,True,attack,Not fleeing,False
4,9,Michael Rodriguez,04/01/15,shot,nail gun,39.0,M,H,Evans,CO,False,attack,Not fleeing,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
2530,2822,Rodney E. Jacobs,28/07/17,shot,gun,31.0,M,NaN,Kansas City,MO,False,attack,Not fleeing,False
2531,2813,TK TK,28/07/17,shot,vehicle,NaN,M,NaN,Albuquerque,NM,False,attack,Car,False
2532,2818,Dennis W. Robinson,29/07/17,shot,gun,48.0,M,NaN,Melba,ID,False,attack,Car,False
2533,2817,Isaiah Tucker,31/07/17,shot,vehicle,28.0,M,B,Oshkosh,WI,False,attack,Car,True
2534,2815,Dwayne Jeune,31/07/17,shot,knife,32.0,M,B,Brooklyn,NY,True,attack,Not fleeing,False

In [3]:
df.head(5)

,id,name,date,manner_of_death,armed,age,gender,race,city,state,signs_of_mental_illness,threat_level,flee,body_camera
0,3,Tim Elliot,02/01/15,shot,gun,53.0,M,A,Shelton,WA,True,attack,Not fleeing,False
1,4,Lewis Lee Lembke,02/01/15,shot,gun,47.0,M,W,Aloha,OR,False,attack,Not fleeing,False
2,5,John Paul Quintero,03/01/15,shot and Tasered,unarmed,23.0,M,H,Wichita,KS,False,other,Not fleeing,False
3,8,Matthew Hoffman,04/01/15,shot,toy weapon,32.0,M,W,San Francisco,CA,True,attack,Not fleeing,False
4,9,Michael Rodriguez,04/01/15,shot,nail gun,39.0,M,H,Evans,CO,False,attack,Not fleeing,False